package com.example.mohaasaba.ibadah;

import android.content.Context;
import android.content.res.AssetManager;

import androidx.annotation.NonNull;
import androidx.room.Database;
import androidx.room.Room;
import androidx.room.RoomDatabase;
import androidx.room.TypeConverters;
import androidx.sqlite.db.SupportSQLiteDatabase;

import com.example.mohaasaba.database.DataConverter;
import com.example.mohaasaba.ibadah.bookshelf.Book;
import com.example.mohaasaba.ibadah.bookshelf.BookDao;
import com.example.mohaasaba.ibadah.tasbih.Tasbih;
import com.example.mohaasaba.ibadah.tasbih.TasbihDao;
import com.example.mohaasaba.models.Progress;

import java.util.Calendar;

import jxl.Workbook;

@Database(entities = {Book.class, Tasbih.class}, version = 1)
@TypeConverters({DataConverter.class})
public abstract class IbadahDB extends RoomDatabase {
    private static IbadahDB ibadahDBInstance;

    public abstract BookDao bookDao();
    public abstract TasbihDao tasbihDao();

    public static synchronized IbadahDB getInstance(Context context) {
        if (ibadahDBInstance == null) {
            ibadahDBInstance = Room.databaseBuilder(context.getApplicationContext(), IbadahDB.class, "bookDB")
                    .fallbackToDestructiveMigration()
                    .addCallback(roomCallbacks)
                    .build();
        }

        return ibadahDBInstance;
    }


    private static RoomDatabase.Callback roomCallbacks = new RoomDatabase.Callback() {
        @Override
        public void onCreate(@NonNull SupportSQLiteDatabase db) {
            super.onCreate(db);
            Thread thread = new Thread(IbadahDB::populateDatabase);
            thread.start();
        }
    };

    private static void populateDatabase() {
        createZikirTable();
    }

    private static void createZikirTable() {
        TasbihDao tasbihDao = ibadahDBInstance.tasbihDao();

        Tasbih salat_1 = new Tasbih();
        salat_1.tasbihType = Tasbih.TasbihType.AFTER_SALAT;
        Progress p_1 = salat_1.history.getProgress(Calendar.getInstance());
        p_1.target = 5;
        salat_1.history.commitProgress(p_1, Calendar.getInstance());
        salat_1.label = "আয়াতুল কুরসি";
        salat_1.doa_ar = "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ ۚ اَلۡحَیُّ الۡقَیُّوۡمُ ۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ ؕ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الۡاَرۡضِ ؕ مَنۡ ذَا الَّذِیۡ یَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ ؕ یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡهِمۡ وَمَا خَلۡفَهُمۡ ۚ وَلَا یُحِیۡطُوۡنَ بِشَیۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِیُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ ۚ وَلَا یَـُٔوۡدُهٗ حِفۡظُهُمَا ۚ وَهُوَ الۡعَلِیُّ الۡعَظِیۡمُ";
        salat_1.doa_bn = "আল্লাহ ছাড়া অন্য কোন উপাস্য নেই, তিনি জীবিত, সবকিছুর ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না এবং নিদ্রাও নয়। আসমান ও যমীনে যা কিছু রয়েছে, সবই তাঁর। কে আছ এমন, যে সুপারিশ করবে তাঁর কাছে তাঁর অনুমতি ছাড়া? দৃষ্টির সামনে কিংবা পিছনে যা কিছু রয়েছে সে সবই তিনি জানেন। তাঁর জ্ঞানসীমা থেকে তারা কোন কিছুকেই পরিবেষ্টিত করতে পারে না, কিন্তু যতটুকু তিনি ইচ্ছা করেন। তাঁর সিংহাসন সমস্ত আসমান ও যমীনকে পরিবেষ্টিত করে আছে। আর সেগুলোকে ধারণ করা তাঁর পক্ষে কঠিন নয়। তিনিই সর্বোচ্চ এবং সর্বাপেক্ষা মহান।";
        salat_1.references = "হাদীসটি হাকিম সংকলন করেছেন, ১/৫৬২। আর শাইখ আলবানী একে সহীহুত তারগীব ওয়াত-তারহীবে সহীহ বলেছেন ১/২৭৩। আর তিনি একে নাসাঈ, তাবারানীর দিকে সম্পর্কযুক্ত করেছেন এবং বলেছেন, তাবারানীর সনদ ‘জাইয়্যেদ’ বা ভালো।";
        salat_1.reward = "১। যে ব্যাক্তি প্রত্যেক সালাতের পর আয়াতুল কুরসী পাঠ করবে তার জান্নাতে প্রবেশের পথে কেবল মৃত্যুই বাধা। \n" +
                "২। যে ব্যাক্তি ফরয সালাতের শেষে আায়াতুল কুরসী পাঠ করবে সে পরবর্তি সালাত পর্যন্ত আল্লাহর জিম্মায় থাকবে। (রাহে বেলায়াত ৭ম/৪৫৭)";
        tasbihDao.insert(salat_1);

        Tasbih salat_2 = new Tasbih();
        salat_2.tasbihType = Tasbih.TasbihType.AFTER_SALAT;
        Progress p_2 = salat_2.history.getProgress(Calendar.getInstance());
        p_2.target = 5;
        salat_2.history.commitProgress(p_2, Calendar.getInstance());
        salat_2.label = "اَللّٰهُمَّ أعِنِّي عَلَى ذِكْرِكَ ...";
        salat_2.doa_ar = "اَللّٰهُمَّ ﴿رَبِّ﴾ أعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ";
        salat_2.doa_bn = "হে আল্লাহ! তোমার যিকর করার, তোমার কৃতজ্ঞতা প্রকাশ করার এবং উত্তমরূপে তোমার ইবাদত করার ব্যাপারে আমাকে সাহায্য কর।";
        salat_2.references = "(নাসায়ী ১৩০৩, আবূ দাউদ ১৫২২, আহমাদ ২১৬২১ )";
        salat_2.reward = "মু‘আয (রাঃ) থেকে বর্ণিতঃ:\n" +
                "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হাত ধরে বললেন, ‘‘হে মু‘আয! আল্লাহর শপথ! নিঃসন্দেহে আমি তোমাকে ভালবাসি। অতঃপর আমি তোমাকে অসিয়ত করছি, হে মু‘আয! তুমি প্রত্যেক নামাযের পশ্চাতে এ শব্দগুলো বলা ছাড়বে না, ‘আল্লা-হুম্মা আ‘ইন্নী আলা যিকরিকা ওয়াশুকরিকা অহুসনি ইবা-দাতিক।’’ (অর্থাৎ হে আল্লাহ! তোমার যিকর করার, তোমার কৃতজ্ঞতা প্রকাশ করার এবং উত্তমরূপে তোমার ইবাদত করার ব্যাপারে আমাকে সাহায্য কর।) ";
        tasbihDao.insert(salat_2);

        Tasbih salat_3 = new Tasbih();
        salat_3.tasbihType = Tasbih.TasbihType.AFTER_SALAT;
        Progress p_3 = salat_3.history.getProgress(Calendar.getInstance());
        p_3.target = 5;
        salat_3.history.commitProgress(p_3, Calendar.getInstance());
        salat_3.label = "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ";
        salat_3.doa_ar = " اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَ أَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ َ";
        salat_3.doa_bn = "‘হে আল্লাহ্\u200C! আমি ভীরুতা, অতি বার্ধক্য, দুনিয়ার ফিতনা ও কবরের শাস্তি থেকে আপনার নিকট পানাহ চাই।’ ";
        salat_3.references = "সহিহ বুখারী, হাদিস নং ২৮২২, রাহে বেলায়াত ৭ম/৪৫৯";
        salat_3.reward = "‘আম্\u200Cর ইব্\u200Cনু মায়মূন আউদী (রহঃ) থেকে বর্ণিতঃ:\n" +
                "শিক্ষক যেমন ছাত্রদের লেখা শিক্ষা দেন, সা’দ (রাঃ) তেমনি তাঁর সন্তানদের এ বাক্যগুলো শিক্ষা দিতেন এবং বলতেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাতের পর এগুলো থেকে পানাহ চাইতেন, ‘হে আল্লাহ্\u200C! আমি ভীরুতা, অতি বার্ধক্য, দুনিয়ার ফিতনা ও কবরের শাস্তি থেকে আপনার নিকট পানাহ চাই।’ রাবী বলেন আমি মুস‘আব (রাঃ)-এর নিকট হাদীসটি বর্ণনা করলে তিনি এটির সত্যতা স্বীকার করেন।";
        tasbihDao.insert(salat_3);

        Tasbih salat_4 = new Tasbih();
        salat_4.tasbihType = Tasbih.TasbihType.AFTER_SALAT;
        Progress p_4 = salat_4.history.getProgress(Calendar.getInstance());
        p_4.target = 5;
        salat_4.history.commitProgress(p_4, Calendar.getInstance());
        salat_4.label = " اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ ...";
        salat_4.doa_ar = " اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّيْ أَنْتَ الْمُقَدِّمُ وَالْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ";
        salat_4.doa_bn = "হে আল্লাহ! আপনও আমার জন্য ক্ষমা করুন আমি পুর্বে যা করেছি এবং পশ্চাতে যা করেছি, " +
                "গোপনে যা করেছি এবং প্রকাশ্যে যা করেছি এবং বাড়াবাড়ি করে যা করেছি এবং যা আপনি আমার চেযেও বেশি জানেন। " +
                "আপনিই অগ্রবর্তী করেন, আপনিই পিছিয়ে দেন। আপনি ছাড়া কোন মাবুদ নেই।";
        salat_4.references = "সুনানে আবু দাউদ, হাদিস নং ৭৬০, রাহে বেলায়াত ৭ম/৪৬০";
        salat_4.reward = "‘আলী ইবনু আবূ ত্বালিব (রাঃ) থেকে বর্ণিতঃ:\n" +
                "তিনি বলেন, রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সলাতে দাঁড়িয়ে তাকবীর বলার পর নিম্নোক্ত দু‘আ পাঠ করতেনঃ " +
                "“ওয়াজ্জাহতু ওয়াজহিয়া লিল্লাযী ফাত্বারাস্\u200C সামাওয়াতি ওয়াল আরদা হানীফাও ওয়ামা আনা মিনাল মুশরিকীন।…\n" +
                "...তারপর সলাত শেষে সালাম ফিরিয়ে তিনি এ দু‘আ পাঠ করতেনঃ “আল্লাহুম্মাগফিরলী মা ক্বাদ্দামতু ওয়ামা আখ্\u200Cখারতু, " +
                "ওয়ামা আসসারতু ওয়ামা আলানতু ওয়ামা আসরাফতু ওয়ামা আনতা আ‘লামু বিহী মিন্নী। " +
                "আনতাল মুক্বাদ্দিমু ওয়াল মুআখখিরু লা-ইলাহা ইল্লা আনতা।";
        tasbihDao.insert(salat_4);

        Tasbih salat_5 = new Tasbih();
        salat_5.tasbihType = Tasbih.TasbihType.AFTER_SALAT;
        Progress p_5 = salat_5.history.getProgress(Calendar.getInstance());
        p_5.target = 5;
        salat_5.history.commitProgress(p_5, Calendar.getInstance());
        salat_5.label = "اَللّٰھُمَّ أَصْلِحْ لِيْ دِيْنِيَ الَّذِيْ ...";
        salat_5.doa_ar = "اَللّٰھُمَّ أَصْلِحْ لِيْ دِيْنِيَ الَّذِيْ جَعَلتَهُ عَصْمَةَ أَمْرِي، وَ أَصْلِحْ لِيْ دُنْيَايَ الَّتِيْ جَعَلتَ فِيْهَا مَعَاشِيْ، اللَّهُمَّ أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ،وَ بِعَفْوِكَ مِنْ نِقْمَتِكَ، وَ أَعُوُذُ بِكَ مِنْكَ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَ لَا مُعْطِيَ لِمَا مَنَعْتَ، وَ لَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ";
        salat_5.doa_bn = "হে আল্লাহ আপনি আমার দ্বীনকে সংশোধিত-কল্যাণময় করুন, যাকে আপনি আমার রক্ষাকবজ বানিয়েছেন " +
                "এবং আমার পার্থিব জীবনকে সংশোধিত করুন, যাতে আমার জীবন ও জিবিকা রেখেছেন। হে আল্লাহ আমি আপনার অসন্তুষ্টি " +
                "থেকে আপনার সন্তুষ্টির নিকট, আপনার শাস্তি থেকে আপনার ক্ষমার নিকট এবং আপনার থেকে আপনার নিকট আশ্রয় প্রার্থণা করছি। " +
                "হে আল্লাহ, আপনি যা প্রদান করেন তা কেউ রোধ করতে পারে না এবং আপনি যা দেন না তা কেউ প্রদান করার ক্ষমতাও রাখে না। " +
                "আর কোনো পরিশ্রমকারীর পরিশ্রম আপনার ইচ্ছার বাইরে তার কোনো উপকারে লাগে না।";
        salat_5.references = "রাহে বেলায়াত ৭ম/৪৬১";
        salat_5.reward = "সুহাইব (রাঃ) বলেনঃ রসূলু্ল্লাহ সল্লাল্লহু আলাইহি ওয়া সাল্লাম নামাজ শেষ করার সময় এ দোয়া বলতেন। ";
        tasbihDao.insert(salat_5);

        Tasbih salat_6 = new Tasbih();
        salat_6.tasbihType = Tasbih.TasbihType.AFTER_SALAT;
        Progress p_6 = salat_6.history.getProgress(Calendar.getInstance());
        p_6.target = 5;
        salat_6.history.commitProgress(p_6, Calendar.getInstance());
        salat_6.label = "...مِنْ عَمَلٍ يُخْزِيْنِيْ...";
        salat_6.doa_ar = "اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَمَلٍ يُخْزِيْنِيْ، اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ غِنًى يُطْغِيْنِيْ، اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ صَاحِبٍ يُرْدِيْنِيْ، اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ أَمَلٍ يُلْهِيْنِيْ، اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ فَقْرٍ يُنْسِيْنِيُّْ";
        salat_6.doa_bn = "হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় প্রার্থণা করছি এমন কর্ম থেকে যা আমাকে অপমানিত করবে। হ" +
                "ে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় প্রার্থণা করছি এরূপ ধনাঢ্যতা থেকে যা আমাকে অহংকারী করে তুলবে। " +
                "হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় প্রার্থণা করছি এরূপ বন্ধু থেকে যে আমাকে ক্ষতিগ্রস্থ করবে। " +
                "হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় প্রার্থণা এরূপ সকল বিষয় থেকে যা আমাকে অপ্রয়োজনে ব্যস্ত করে তুলবে। " +
                "হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় প্রার্থণা এরূপ দারিদ্রতা থেকে যা আমাকে (আপনার কথা) ভুলিয়ে দেবে।";
        salat_6.references = "রাহে বেলায়াত ৭ম/৪৬৮";
        salat_6.reward = "আনাস (রাঃ) বলেন,\n" +
                "রসূলুল্লাহ সল্লাল্লহু আলাইহি ওয়া সাল্লাম যখন(ই) সাহাবীগণকে নিয়ে (ফরয) নামাজ পড়তেন তখন নামাজ শেষে তাদের দিকে ঘুরে বসে এ দু’আ বলতেন।";
        tasbihDao.insert(salat_6);

        Tasbih morning_1 = new Tasbih();
        morning_1.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_1.label = "حَسْبِيَ اللّٰهُ لاَ إِلَهَ إِلاَّ هُوَ";
        morning_1.doa_ar = "حَسْبِيَ اللّٰهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ";
        morning_1.doa_bn = "আল্লাহই আমার জন্য যথেষ্ট, তিনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি তাঁর উপরই ভরসা করি। আর তিনি মহান আরশের রব্ব।";
        morning_1.references = "ইবনুস সুন্নী, নং ৭১, মারফূ‘ সনদে; আবূ দাউদ ৪/৩২১; মাওকূফ সনদে, নং ৫০৮১। আর শাইখ শু‘আইব ও আব্দুল কাদের আরনাঊত এর সনদকে সহীহ বলেছেন। দেখুন, যাদুল মা‘আদ ২/৩৭৬।";
        morning_1.reward = "যে ব্যাক্তি সকাল ও সন্ধায় ৭ বার এটি বলবে আল্লাজ তায়ালা তার দুশ্চিন্তা, উৎকণ্ঠা ও সমস্যা মিটিয়ে দেবেন। (রাহে বেলায়াত ৭ম/৪৮৩)";
        tasbihDao.insert(morning_1);

        Tasbih morning_2 = new Tasbih();
        morning_2.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_2.label = "বিষধর প্রাণীর ক্ষতি থেকে নিরাপত্তাَ";
        morning_2.doa_ar = "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ";
        morning_2.doa_bn = "হযরত আবু হোরাযরা (রাঃ) বর্ণনা করেনঃ\n" +
                "নবী করীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এরশাদ করেন, যে ব্যাক্তি সন্ধার সময় তিনবার এই কালিমাগুলি বলবে- “আল্লাহ্\u200Cর পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।\" সে রাত্রে কোনো প্রকার বিষ তার ক্ষতি করতে পারবে না।";
        morning_2.references = "মুন্তাখাব হাদীস ২য়/৪৬৬, আহমাদ ২/২৯০, নং ৭৮৯৮; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৫৯০; ইবনুস সুন্নী, নং ৬৮; আরও দেখুন, সহীহুত তিরমিযী ৩/১৮৭; সহীহ ইবন মাজাহ ২/২৬৬; তুহফাতুল আখইয়ার লি ইবন বায, পৃ. ৪৫।";
        morning_2.reward = "যে ব্যাক্তি সন্ধার সময় তিনবার এই কালিমাগুলি বলবে- “আল্লাহ্\u200Cর পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।\" সে রাত্রে কোনো প্রকার বিষ তার ক্ষতি করতে পারবে না।";
        tasbihDao.insert(morning_2);

        Tasbih morning_3 = new Tasbih();
        morning_3.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_3.label = "কোনো কিছু তার ক্ষতি করতে পারবে না";
        morning_3.doa_ar = "بِسْمِ اللّٰهِ الَّذِيْ لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِيْ الْأَرْضِ وَلاَ فِيْ السَّمَاءِ وَهُوَ السَّمِيْعُ الْعَلِيْمُ َ";
        morning_3.doa_bn = "আল্লাহ্\u200Cর নামে; যাঁর নামের সাথে আসমান ও যমীনে কোনো কিছুই ক্ষতি করতে পারে না। আর তিনি সর্বশ্রোতা, মহাজ্ঞানী।" +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : প্রতিদিন ভোরে ও প্রতি রাতের সন্ধ্যায় যে কোন বান্দা এ দু‘আটি তিনবার পাঠ করবে কোন কিছুই তার অনিষ্ট করতে পারবে না : “বিসমিল্লা-হিল্লাযী…\n" +
                "আবান (রহঃ)-এর শরীরের একাংশ পক্ষাঘাতগ্রস্ত হয়ে পড়ে। (উক্ত হাদীস রিওয়ায়াতকালে) এক লোক (অধঃস্তন বর্ণনাকারী) তার দিকে তাকাতে থাকলে তিনি তাকে বলেন, তুমি কি প্রত্যক্ষ করছো? শোন! আমি তোমার কাছে যে হাদীস রিওয়ায়াত করেছি তা অবিকল বর্ণনা করেছি। তবে আমি যেদিন পক্ষাঘাতগ্রস্ত হয়েছি ঐ দু‘আটি পাঠ করিনি এবং আল্লাহ তা‘আলা ভাগ্যের লিখন আমার উপর কার্যকর করেছেন।";
        morning_3.references = "আবূ দাউদ, ৪/৩২৩, নং ৫০৮৮; তিরমিযী, ৫/৪৬৫, নং ৩৩৮৮; ইবন মাজাহ, নং ৩৮৬৯; আহমাদ, নং ৪৪৬। আরও দেখুন, সহীহ ইবন মাজাহ, ২/৩৩২। আর আল্লামা ইবন বায রাহিমাহুল্লাহ তাঁর ‘তুহফাতুল আখইয়ার’ গ্রন্থের ৩৯ পৃষ্ঠায় এটার সনদকে হাসান বলেছেন।";
        morning_3.reward = "যে ব্যাক্তি সন্ধার সময় তিনবার এই কালিমাগুলি বলবে- “আল্লাহ্\u200Cর পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।\" সে রাত্রে কোনো প্রকার বিষ তার ক্ষতি করতে পারবে না।";
        tasbihDao.insert(morning_3);

        Tasbih morning_4 = new Tasbih();
        morning_4.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_4.label = "اللّٰهُمَّ مَا أَصْبَحَ (أَمْسَى) بِيْ আল্লাহর নিকট শুকরিয়া আদায়";
        morning_4.doa_ar = "اللّٰهُمَّ مَا أَصْبَحَ (أَمْسَى) بِيْ مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ َ";
        morning_4.doa_bn = "হে আল্লাহ! যে নেয়ামত আমার সাথে সকালে (বিকালে) উপনীত হয়েছে, অথবা আপনার সৃষ্টির অন্য কারও সাথে; এসব নেয়ামত কেবলমাত্র আপনার নিকট থেকেই; আপনার কোনো শরীক নেই। সুতরাং সকল প্রশংসা আপনারই। আর সকল কৃতজ্ঞতা আপনারই প্রাপ্য।";
        morning_4.references = "হাদীসটি সংকলন করেছেন, আবূ দাউদ ৪/৩১৮, নং ৫০৭৫; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৭; ইবনুস সুন্নী, নং ৪১; ইবন হিব্বান, (মাওয়ারিদ) নং ২৩৬১। আর শাইখ ইবন বায তাঁর তুহফাতুল আখইয়ার পৃ. ২৪ এ এর সনদকে হাসান বলেছেন।";
        morning_4.reward = "আবদুল্লাহ ইবনু গান্নাম আল-বায়াদী (রাঃ) থেকে বর্ণিতঃ\n" +
                "তিনি বলেন, রাসূলুল্লাহ্\u200C (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি সকালে উপনীত হয়ে বলেনঃ “হে আল্লাহ্\u200C! …\n" +
                "সে তার ঐ দিনের কৃতজ্ঞতা প্রকাশ করলো। আর যে ব্যক্তি সন্ধ্যায় উপনীত হয়ে এরূপ বললো সে তার ঐ রাতের কৃতজ্ঞতা স্বীকার করলো।";
        tasbihDao.insert(morning_4);

        Tasbih morning_5 = new Tasbih();
        morning_5.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_5.label = "কিয়ামতের দিনে আল্লাহর সন্তুষ্টি";
        morning_5.doa_ar = "رَضِيْتُ بِاللّٰهِ رَبًّا، وَبِالْإِسْلاَمِ دِيْنًا وَّبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا َ";
        morning_5.doa_bn = "আল্লাহকে রব, ইসলামকে দীন ও মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নবীরূপে গ্রহণ করে আমি সন্তুষ্ট।";
        morning_5.references = "(রাহে বেলায়াত ৭ম/৪৮৪) \n" +
                "আহমাদ ৪/৩৩৭; নং ১৮৯৬৭; নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ৪; ইবনুস সুন্নী, নং ৬৮; আবু দাউদ, ৪/৩১৮, নং ১৫৩১; তিরমিযী ৫/৪৬৫, নং ৩৩৮৯। আর ইবন বায রাহিমাহুল্লাহ ‘তুহফাতুল আখইয়ার’ এর ৩৯ পৃষ্ঠায় একে হাসান বলেছেন।";
        morning_5.reward = "আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিতঃ\n" +
                "রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন যে ব্যক্তি বলে : আমি আল্লাহকে রব্ব, ইসলামকে দ্বীন এবং মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে রসূল হিসেবে সন্তুষ্টচিত্তে মেনে নিয়েছি, তার জন্য জান্নাত ওয়াজিব হয়ে গেছে।\n" +
                "\n" +
                "অন্য বর্ণনায় এসেছে, মুনাইযির (রাঃ) বলেন,\n" +
                "রসূলুল্লাহ সল্লাল্লাহু আলাইহি ওয়া সাল।লাম বলেছেন, “যে ব্যাক্তি সকালে এ বাক্যগুলো বলবে আমি দায়িত্ব গ্রহণ করছি যে, তার হাত ধরে তাকে জান্নাতে প্রবেশ করাব\u200C।\"";
        tasbihDao.insert(morning_5);

        Tasbih morning_6 = new Tasbih();
        morning_6.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_6.label = "সায়্যিদুল ইসতিগফার (ক্ষমা চাওয়ার শ্রেষ্ঠ দোআ)";
        morning_6.doa_ar = "اللّٰهُمَّ أَنْتَ رَبِّيْ لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ";
        morning_6.doa_bn = "হে আল্লাহ্\u200C! আপনি আমার রব্ব, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা। " +
                "আর আমি আমার সাধ্য মতো আপনার (তাওহীদের) অঙ্গীকার ও (জান্নাতের) প্রতিশ্রুতির উপর রয়েছি। আমি আমার কৃতকর্মের অনিষ্ট থেকে আপনার আশ্রয় চাই।" +
                "আপনি আমাকে আপনার যে নিয়ামত দিয়েছেন তা আমি স্বীকার করছি, আর আমি স্বীকার করছি আমার অপরাধ।" +
                "অতএব আপনি আমাকে মাফ করুন। নিশ্চয় আপনি ছাড়া আর কেউ গুনাহসমূহ মাফ করে না।";
        morning_6.references = "(আধুনিক প্রকাশনী- ৫৮৭৮, ইসলামিক ফাউন্ডেশন- ৫৭৭১)";
        morning_6.reward = "শাদ্দাদ ইবনু আওস (রাঃ) থেকে বর্ণিতঃ\n" +
                "নবী (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) বলেন, সাইয়্যিদুল ইস্তিগফার হলোঃ \"হে আল্লাহ! ...\" \n" +
                "যে লোক সন্ধ্যা বেলায় এ দু'আ পড়বে, আর এ রাতেই মারা যাবে, সে জান্নাতে প্রবেশ করবে। রাবী বলেন, অথবা তিনি বলেছেনঃ সে হবে জান্নাতী। আর যে লোক সকালে এ দু'আ পড়বে, আর এ দিনেই মারা যাবে সেও তেমনি জান্নাতী হবে।";
        tasbihDao.insert(morning_6);

        Tasbih morning_7 = new Tasbih();
        morning_7.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_7.label = "জাহান্নামের আগুন থেকে মুক্তি";
        morning_7.doa_ar = "اللّٰهُمَّ إِنّيْ أَصْبَحْتُ (أَمْسَيْتُ) أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيْعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللّٰهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُوْلُكَ";
        morning_7.doa_bn = "হে আল্লাহ! আমি সকালে (বিকালে) উপনীত হয়েছি। আপনাকে আমি সাক্ষী রাখছি, " +
                "আরও সাক্ষী রাখছি আপনার ‘আরশ বহনকারীদেরকে, আপনার ফেরেশতাগণকে ও আপনার সকল সৃষ্টিকে, " +
                "(এর উপর) যে— নিশ্চয় আপনিই আল্লাহ, একমাত্র আপনি ছাড়া আর কোন হক্ব ইলাহ নেই, আপনার কোনো শরীক নেই; " +
                "আর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনার বান্দা ও রাসূল।";
        morning_7.references = "(আবূ দাউদ ৪/৩১৭, নং ৫০৭১; বুখারী, আল-আদাবুল মুফরাদ, নং ১২০১; নাসাঈ, ‘আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৯; ইবনুস সুন্নী, নং ৭০। সম্মানিত শাইখ আবদুল আযীয ইবন বায রাহেমাহুল্লাহ তাঁর তুহফাতুল আখইয়ার গ্রন্থের পৃ. ২৩ এ নাসাঈ ও আবূ দাউদের সনদকে হাসান বলেছেন। [হিসনুল মুসলিম]";
        morning_7.reward = "আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ\n" +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি সকালে বা সন্ধ্যায় উপনীত হয়ে বলবেঃ  “হে আল্লাহ্\u200C! …\n" +
                "আল্লাহ তার এক-চতুর্থাংশ দেহ জাহান্নামের শাস্তি হতে মুক্তি দিবেন। আর যে ব্যক্তি তা দুইবার বলবে, আল্লাহ তার শরীরের অর্ধেক জাহান্নামের আগুন হতে মুক্তি দিবেন। আর যে ব্যক্তি তা তিনবার বলবে আল্লাহ তার শরীরের তিন-চতুর্থাংশ এবং চারবার বললে তার সমস্ত শরীর জাহান্নামের আগুন হতে মুক্তি দিবেন। ";
        tasbihDao.insert(morning_7);

        Tasbih morning_8 = new Tasbih();
        morning_8.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_8.label = "صْبَحْنَا وَأَصْبَحَ (أَمْسَيْنَا وَ أَمْسَىا) الْمُلْكُ لِلّٰهِ  (মাসনুন)";
        morning_8.doa_ar = "أَصْبَحْنَا وَأَصْبَحَ (أَمْسَيْنَا وَ أَمْسَىا) الْمُلْكُ لِلّٰهِ، وَالْحَمْدُ لِلّٰهِ، لاَ إِلَهَ إلاَّ اللّٰهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ (هَذِهِ اللَّيْلَةِ) وَخَيْرَ مَا بَعْدَهُ (بَعْدَهَا)، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هَذَا الْيَوْمِ (هَذِهِ اللَّيْلَةِ) وَشَرِّ مَا بَعْدَهُ (بَعْدَهَا)، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ";
        morning_8.doa_bn = "আমরা আল্লাহর জন্য সকালে (বিকালে) উপনীত হয়েছি, অনুরূপ যাবতীয় রাজত্বও সকালে (বিকালে) উপনীত হয়েছে, " +
                "আল্লাহ্\u200Cর জন্য। সমুদয় প্রশংসা আল্লাহ্\u200Cর জন্য। একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। " +
                "রাজত্ব তাঁরই এবং প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান। হে রব্ব! " +
                "এই দিনের (রাতের) মাঝে এবং এর পরে যা কিছু কল্যাণ আছে আমি আপনার নিকট তা প্রার্থনা করি। " +
                "আর এই দিনের (রাতের) মাঝে এবং এর পরে যা কিছু অকল্যাণ আছে, তা থেকে আমি আপনার আশ্রয় চাই। " +
                "হে রব্ব! আমি আপনার কাছে আশ্রয় চাই অলসতা ও খারাপ বার্ধক্য থেকে। " +
                "হে রব্ব!আমি আপনার কাছে আশ্রয় চাই জাহান্নামে আযাব হওয়া থেকে এবং কবরে আযাব হওয়া থেকে।";
        morning_8.references = "মুসলিম, ৪/২০৮৮, নং ২৭২৩।";
        morning_8.reward = "রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সকাল ও সন্ধায় এ দুয়াটি বলতেন।";
        tasbihDao.insert(morning_8);

        Tasbih morning_9 = new Tasbih();
        morning_9.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_9.label = "اللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِي  (মাসনুন)";
        morning_9.doa_ar = "اللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِي، اللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِي، اللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، اللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ";
        morning_9.doa_bn = "হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার শরীরে। হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার শ্রবণশক্তিতে। " +
                "হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার দৃষ্টিশক্তিতে। আপনি ছাড়া কোনো হক্ব ইলাহ নেই। " +
                "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই কুফরি ও দারিদ্র্য থেকে। আর আমি আপনার আশ্রয় চাই কবরের আযাব থেকে। " +
                "আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই।";
        morning_9.references = "আবূ দাউদ ৪/৩২৪, নং ৫০৯২; আহমাদ ৫/৪২, নং ২০৪৩০; নাসাঈ, আমালুল ইয়াওমি ওয়াল্লাইলাহ, নং ২২; ইবনুস সুন্নী, নং ৬৯; বুখারী, আল-আদাবুল মুফরাদ, নং ৭০১। আর শাইখ আল্লামা ইবন বায রাহিমাহুল্লাহ ‘তুহফাতুল আখইয়ার’ গ্রন্থের পৃ. ২৬ এ এর সনদকে হাসান বলেছেন।";
        morning_9.reward = "‘আবদুর রহমান ইবনু আবূ বাকর (রাঃ) থেকে বর্ণিতঃ\n" +
                "আমি আমার পিতাকে বললাম, হে আব্বাজান! আমি আপনাকে প্রতিদিন ভোরে ও সন্ধ্যায় তিনবার বলতে শুনি: " +
                "“হে আল্লাহ! আমার দেহ সুস্থ রাখুন। হে আল্লাহ! আমাকে সুস্থ রাখুন আমার শ্রবণ ইন্দ্রিয়ে। হে আল্লাহ! " +
                "আমাকে সুস্থ রাখুন আমার দৃষ্টিশক্তিতে। আপনি ছাড়া কোন ইলাহ নাই।” " +
                "তিনি বললেন, আমি রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে এ বাক্যগুলো দ্বারা দু‘আ করতে শুনেছি। " +
                "সেজন্য আমিও তার নিয়ম অনুসরণ করতে ভালোবাসি। ‘আব্বাস (রাঃ)-এর বর্ণনায় রয়েছে তিনি বললেনঃ " +
                "“হে আল্লাহ! আপনার নিকট কুফরী ও দরিদ্রতা হতে আশ্রয় চাইছি। হে আল্লাহ! আমি কবরের আযাব হতে আপনার নিকট আশ্রয় চাইছি, " +
                "আপনি ছাড়া অন্য কোন ইলাহ নেই।” তিনি এ দু‘আ সকালে তিনবার ও সন্ধ্যায় তিনবার করে বলতেন। " +
                "তাই আমিও তাঁর নিয়ম অনুসরণ করতে ভালোবাসি। বর্ণনাকারী বলেন, " +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: বিপদগ্রস্থ ব্যক্তির দু‘আ হলো : " +
                "“হে আল্লাহ! আমি আপনার রহমত প্রার্থী। কাজেই আমাকে এক পলকের জন্যও আমার নিজের নিকট সোপর্দ করবেন না " +
                "এবং আমার সবকিছু সুষ্ঠভাবে সম্পন্ন করে দিন। আর আপনিই একমাত্র ইলাহ।";
        tasbihDao.insert(morning_9);

        Tasbih morning_10 = new Tasbih();
        morning_10.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_10.label = "...الْعَفْوَ وَالْعَافِيَةَ...";
        morning_10.doa_ar = "اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ الدُّنْيَا وَالآخِرَةِ، اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللّٰهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَّمِيْنِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ ";
        morning_10.doa_bn = "হে আল্লাহ! আমি আপনার নিকট দুনিয়া ও আখেরাতে ক্ষমা ও নিরাপত্তা প্রার্থনা করছি। " +
                "হে আল্লাহ! আমি আপনার নিকট ক্ষমা এবং নিরাপত্তা চাচ্ছি আমার দ্বীন, দুনিয়া, পরিবার ও অর্থ-সম্পদের। " +
                "হে আল্লাহ! আপনি আমার গোপন ত্রুটিসমূহ ঢেকে রাখুন, আমার উদ্বিগ্নতাকে রূপান্তরিত করুন নিরাপত্তায়। " +
                "হে আল্লাহ! আপনি আমাকে হেফাযত করুন আমার সামনের দিক থেকে, আমার পিছনের দিক থেকে, আমার ডান দিক থেকে, আমার বাম দিক থেকে " +
                "এবং আমার উপরের দিক থেকে। আর আপনার মহত্ত্বের অসিলায় আশ্রয় চাই আমার নীচ থেকে হঠাৎ আক্রান্ত হওয়া থেকে।";
        morning_10.references = "আবূ দাউদ, নং ৫০৭৪; ইবন মাজাহ্\u200C, নং ৩৮৭১। আরও দেখুন, সহীহ ইবন মাজাহ্\u200C ২/৩৩২।";
        morning_10.reward = "জুবাইর ইবনু আবূ সুলাইমান, ইবনু জুবাইর ইবনু মুত্ব’ইম (রাঃ) সূত্র থেকে বর্ণিতঃ\n" +
                "তিনি বলেন, আমি ইবনু ‘উমার (রাঃ)-কে বলতে শুনেছি, রাসূলুল্লাহ্\u200Cর (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সকাল ও সন্ধ্যায় উপনীত হয়ে এ দু’আগুলো পড়া ছেড়ে দিতেন নাঃ “হে আল্লাহ্\u200C! ...";
        tasbihDao.insert(morning_10);

        Tasbih morning_11 = new Tasbih();
        morning_11.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_11.label = "اللّٰهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ";
        morning_11.doa_ar = "اللّٰهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَّمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَ شِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ";
        morning_11.doa_bn = "হে আল্লাহ! হে গায়েব ও উপস্থিতের জ্ঞানী, হে আসমানসমূহ ও যমীনের স্রষ্টা, হে সব কিছুর রব্ব ও মালিক! " +
                "আমি সাক্ষ্য দিচ্ছি যে, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি আপনার কাছে আশ্রয় চাই আমার আত্মার অনিষ্ট থেকে, " +
                "শয়তানের অনিষ্টতা থেকে ও তার শির্ক বা তার ফাঁদ থেকে, আমার নিজের উপর কোনো অনিষ্ট করা, " +
                "অথবা কোনো মুসলিমের দিকে তা টেনে নেওয়া থেকে।";
        morning_11.references = "তিরমিযী, নং ৩৩৯২; আবূ দাউদ, নং ৫০৬৭। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৪২।";
        morning_11.reward = "আবূ হুরাইরাহ্\u200C (রাঃ) থেকে বর্ণিতঃ\n" +
                "তিনি বলেন, আবূ বকর (রাঃ) বললেন, হে আল্লাহর রাসূল! আমাকে এমন কিছুর হুকুম দিন যা আমি সকালে ও বিকেলে উপনীত হয়ে বলতে পারি। তিনি বললেনঃ তুমি বল, “হে আল্লাহ্\u200C! …\n" +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তুমি এই দু’আ সকালে, বিকেলে ও শয্যা গ্রহণকালে পাঠ করবে। ";
        tasbihDao.insert(morning_11);

        Tasbih morning_12 = new Tasbih();
        morning_12.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_12.label = "নফসের ক্ষতি হতে নিরাপর্তা";
        morning_12.doa_ar = "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ أَصْلِحْ لِيْ شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ";
        morning_12.doa_bn = "হে চিরঞ্জীব, হে চিরস্থায়ী! আমি আপনার রহমতের অসীলায় আপনার কাছে উদ্ধার কামনা করি, " +
                "আপনি আমার সার্বিক অবস্থা সংশোধন করে দিন, আর আমাকে আমার নিজের কাছে নিমেষের জন্যও সোপর্দ করবেন না।";
        morning_12.references = "তহাকেম ১/৫৪৫, তিনি হাদীসটিকে সহীহ বলেছেন, আর যাহাবী তা সমর্থন করেছেন। আরও দেখুন, সহীহ আত-তারগীব ওয়াত-তারহীব ১/২৭৩। মুন্তাখাব হাদীস ২য়/৪৬৫";
        morning_12.reward = "হযরত আনাস ইবনে মালেক (রাঃ) বর্ণনা করেনঃ\n" +
                "হুযুর সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম হযরত ফাতেমা (রাঃ) কে বললেন, আমার নসীহত মনোযোগ দিয়া শুন, তুমি সকাল সন্ধা এই দোয়া পড়িও- “ইয়া হাইয়্যু ইয়া কইয়্যুম…";
        tasbihDao.insert(morning_12);

        Tasbih morning_13 = new Tasbih();
        morning_13.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_13.label = "দশটি দাসমুক্তির অনুরূপ ও একশত সাওয়াব";
        morning_13.doa_ar = "لاَ إِلَهَ إِلاَّ اللّٰهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ";
        morning_13.doa_bn = "একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান।";
        morning_13.references = "[১] নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ২৪। আরও দেখুন, সহীহুত তারগীব ওয়াত তারহীব, ১/২৭২; ইবন বায, তুহফাতুল আখইয়ার পৃ.৪৪। এর ফযীলতের ব্যাপারে আরও দেখন, পৃ.হাদীস নং ২৫৫। \n" +
                "[২] আবূ দাউদ, নং ৫০৭৭; ইবন মাজাহ, নং ৩৭৯৮; আহমাদ নং ৮৭১৯। আরও দেখুন, সহীহুত তারগীব ওয়াত তারহীব, ১/২৭০; সহীহ আবি দাউদ ৩/৯৫৭; সহীহ ইবন মাজাহ ২/৩৩১ ও যাদুল মা‘আদ ২/৩৭৭। \n" +
                "[৩] বুখারী, ৪/৯৫, নং ৩২৯৩; মুসলিম, ৪/২০৭১, নং ২৬৯১।";
        morning_13.reward = "১০ বার [১] অথবা (অলসতা লাগলে) ১ বার [২] বলবে অথবা একশত বার বলবে";
        tasbihDao.insert(morning_13);

        Tasbih morning_14 = new Tasbih();
        morning_14.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_14.label = "উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমলের দো'আ";
        morning_14.doa_ar = "اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًاٌ";
        morning_14.doa_bn = "হে আল্লাহ! আমি আপনার নিকট উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করি।";
        morning_14.references = "হাদীসটি সংকলন করেছেন, ইবনুস সুন্নী, নং ৫৪; ইবন মাজাহ, নং ৯২৫।" +
                " আর আব্দুল কাদের ও শু‘আইব আল-আরনাঊত যাদুল মা‘আদের সম্পাদনায় ২/৩৭৫; এর সনদকে হাসান বলেছেন। " +
                "আর পূর্ব ৭৩ নং এ ও তা গত হয়েছে।";
        morning_14.reward = "উম্মু সালামাহ (রাঃ) থেকে বর্ণিতঃ\n" +
                "হুযুর সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ফজরের সালাতের পর সালাম ফিরিয়ে বলতেন, “হে আল্লাহ! …" +
                "তিন বার সকালবেলা বলবে,";
        tasbihDao.insert(morning_14);

        Tasbih morning_15 = new Tasbih();
        morning_15.tasbihType = Tasbih.TasbihType.MORNING_TASBIH;
        morning_15.label = "হে আল্লাহ! তুমি আমাকে জাহান্নাম থেকে রক্ষা করো";
        morning_15.doa_ar = "اَللّٰهُمَّ أَجِرْنِىْ مِنَ النَّارٌِ";
        morning_15.doa_bn = "হে আল্লাহ! তুমি আমাকে জাহান্নাম থেকে রক্ষা করো";
        morning_15.references = "(আবূ দাঊদ ৫০৭৯, রাহে বেলায়াত ৭ম/৪৫৩)";
        morning_15.reward = "হারিস ইবনু মুসলিম আত্ তামীমী (রহঃ) থেকে বর্ণিতঃ:\n" +
                "তাঁর পিতা হতে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। " +
                "একদিন তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মৃদুস্বরে বললেন, তুমি মাগরিবের সলাত আদায় শেষে কারো সাথে কথা বলার আগে সাতবার পড়বে," +
                " ‘‘আল্ল-হুম্মা আজিরনী মিনান্\u200Cনা-র’’ (অর্থাৎ- হে আল্লাহ! তুমি আমাকে জাহান্নাম থেকে রক্ষা করো)। " +
                "তুমি এ দু‘আ পড়ার পর ঐ রাতে মারা গেলে, তোমার জন্য জাহান্নাম হতে ছাড়পত্র লেখা হবে। " +
                "একইভাবে তুমি ফজরের সলাত আদায়ের পর এ দু‘আ পড়বে, তারপর তুমি ঐ দিন মারা গেলে, তোমাকে জাহান্নাম হতে ছাড়পত্র লেখা হবে। ";
        tasbihDao.insert(morning_15);

        Tasbih evening_1 = new Tasbih();
        evening_1.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_1.label = "حَسْبِيَ اللّٰهُ لاَ إِلَهَ إِلاَّ هُوَ";
        evening_1.doa_ar = "حَسْبِيَ اللّٰهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ";
        evening_1.doa_bn = "আল্লাহই আমার জন্য যথেষ্ট, তিনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি তাঁর উপরই ভরসা করি। আর তিনি মহান আরশের রব্ব।";
        evening_1.references = "ইবনুস সুন্নী, নং ৭১, মারফূ‘ সনদে; আবূ দাউদ ৪/৩২১; মাওকূফ সনদে, নং ৫০৮১। আর শাইখ শু‘আইব ও আব্দুল কাদের আরনাঊত এর সনদকে সহীহ বলেছেন। দেখুন, যাদুল মা‘আদ ২/৩৭৬।";
        evening_1.reward = "যে ব্যাক্তি সকাল ও সন্ধায় ৭ বার এটি বলবে আল্লাজ তায়ালা তার দুশ্চিন্তা, উৎকণ্ঠা ও সমস্যা মিটিয়ে দেবেন। (রাহে বেলায়াত ৭ম/৪৮৩)";
        tasbihDao.insert(evening_1);

        Tasbih evening_2 = new Tasbih();
        evening_2.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_2.label = "বিষধর প্রাণীর ক্ষতি থেকে নিরাপত্তাَ";
        evening_2.doa_ar = "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ";
        evening_2.doa_bn = "হযরত আবু হোরাযরা (রাঃ) বর্ণনা করেনঃ\n" +
                "নবী করীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এরশাদ করেন, যে ব্যাক্তি সন্ধার সময় তিনবার এই কালিমাগুলি বলবে- “আল্লাহ্\u200Cর পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।\" সে রাত্রে কোনো প্রকার বিষ তার ক্ষতি করতে পারবে না।";
        evening_2.references = "মুন্তাখাব হাদীস ২য়/৪৬৬, আহমাদ ২/২৯০, নং ৭৮৯৮; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৫৯০; ইবনুস সুন্নী, নং ৬৮; আরও দেখুন, সহীহুত তিরমিযী ৩/১৮৭; সহীহ ইবন মাজাহ ২/২৬৬; তুহফাতুল আখইয়ার লি ইবন বায, পৃ. ৪৫।";
        evening_2.reward = "যে ব্যাক্তি সন্ধার সময় তিনবার এই কালিমাগুলি বলবে- “আল্লাহ্\u200Cর পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।\" সে রাত্রে কোনো প্রকার বিষ তার ক্ষতি করতে পারবে না।";
        tasbihDao.insert(evening_2);

        Tasbih evening_3 = new Tasbih();
        evening_3.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_3.label = "কোনো কিছু তার ক্ষতি করতে পারবে না";
        evening_3.doa_ar = "بِسْمِ اللّٰهِ الَّذِيْ لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِيْ الْأَرْضِ وَلاَ فِيْ السَّمَاءِ وَهُوَ السَّمِيْعُ الْعَلِيْمُ َ";
        evening_3.doa_bn = "আল্লাহ্\u200Cর নামে; যাঁর নামের সাথে আসমান ও যমীনে কোনো কিছুই ক্ষতি করতে পারে না। আর তিনি সর্বশ্রোতা, মহাজ্ঞানী।" +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : প্রতিদিন ভোরে ও প্রতি রাতের সন্ধ্যায় যে কোন বান্দা এ দু‘আটি তিনবার পাঠ করবে কোন কিছুই তার অনিষ্ট করতে পারবে না : “বিসমিল্লা-হিল্লাযী…\n" +
                "আবান (রহঃ)-এর শরীরের একাংশ পক্ষাঘাতগ্রস্ত হয়ে পড়ে। (উক্ত হাদীস রিওয়ায়াতকালে) এক লোক (অধঃস্তন বর্ণনাকারী) তার দিকে তাকাতে থাকলে তিনি তাকে বলেন, তুমি কি প্রত্যক্ষ করছো? শোন! আমি তোমার কাছে যে হাদীস রিওয়ায়াত করেছি তা অবিকল বর্ণনা করেছি। তবে আমি যেদিন পক্ষাঘাতগ্রস্ত হয়েছি ঐ দু‘আটি পাঠ করিনি এবং আল্লাহ তা‘আলা ভাগ্যের লিখন আমার উপর কার্যকর করেছেন।";
        evening_3.references = "আবূ দাউদ, ৪/৩২৩, নং ৫০৮৮; তিরমিযী, ৫/৪৬৫, নং ৩৩৮৮; ইবন মাজাহ, নং ৩৮৬৯; আহমাদ, নং ৪৪৬। আরও দেখুন, সহীহ ইবন মাজাহ, ২/৩৩২। আর আল্লামা ইবন বায রাহিমাহুল্লাহ তাঁর ‘তুহফাতুল আখইয়ার’ গ্রন্থের ৩৯ পৃষ্ঠায় এটার সনদকে হাসান বলেছেন।";
        evening_3.reward = "যে ব্যাক্তি সন্ধার সময় তিনবার এই কালিমাগুলি বলবে- “আল্লাহ্\u200Cর পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।\" সে রাত্রে কোনো প্রকার বিষ তার ক্ষতি করতে পারবে না।";
        tasbihDao.insert(evening_3);

        Tasbih evening_4 = new Tasbih();
        evening_4.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_4.label = "اللّٰهُمَّ مَا أَصْبَحَ (أَمْسَى) بِيْ আল্লাহর নিকট শুকরিয়া আদায়";
        evening_4.doa_ar = "اللّٰهُمَّ مَا أَصْبَحَ (أَمْسَى) بِيْ مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ َ";
        evening_4.doa_bn = "হে আল্লাহ! যে নেয়ামত আমার সাথে সকালে (বিকালে) উপনীত হয়েছে, অথবা আপনার সৃষ্টির অন্য কারও সাথে; এসব নেয়ামত কেবলমাত্র আপনার নিকট থেকেই; আপনার কোনো শরীক নেই। সুতরাং সকল প্রশংসা আপনারই। আর সকল কৃতজ্ঞতা আপনারই প্রাপ্য।";
        evening_4.references = "হাদীসটি সংকলন করেছেন, আবূ দাউদ ৪/৩১৮, নং ৫০৭৫; নাসাঈ, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৭; ইবনুস সুন্নী, নং ৪১; ইবন হিব্বান, (মাওয়ারিদ) নং ২৩৬১। আর শাইখ ইবন বায তাঁর তুহফাতুল আখইয়ার পৃ. ২৪ এ এর সনদকে হাসান বলেছেন।";
        evening_4.reward = "আবদুল্লাহ ইবনু গান্নাম আল-বায়াদী (রাঃ) থেকে বর্ণিতঃ\n" +
                "তিনি বলেন, রাসূলুল্লাহ্\u200C (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি সকালে উপনীত হয়ে বলেনঃ “হে আল্লাহ্\u200C! …\n" +
                "সে তার ঐ দিনের কৃতজ্ঞতা প্রকাশ করলো। আর যে ব্যক্তি সন্ধ্যায় উপনীত হয়ে এরূপ বললো সে তার ঐ রাতের কৃতজ্ঞতা স্বীকার করলো।";
        tasbihDao.insert(evening_4);

        Tasbih evening_5 = new Tasbih();
        evening_5.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_5.label = "কিয়ামতের দিনে আল্লাহর সন্তুষ্টি";
        evening_5.doa_ar = "رَضِيْتُ بِاللّٰهِ رَبًّا، وَبِالْإِسْلاَمِ دِيْنًا وَّبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا َ";
        evening_5.doa_bn = "আল্লাহকে রব, ইসলামকে দীন ও মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নবীরূপে গ্রহণ করে আমি সন্তুষ্ট।";
        evening_5.references = "(রাহে বেলায়াত ৭ম/৪৮৪) \n" +
                "আহমাদ ৪/৩৩৭; নং ১৮৯৬৭; নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ৪; ইবনুস সুন্নী, নং ৬৮; আবু দাউদ, ৪/৩১৮, নং ১৫৩১; তিরমিযী ৫/৪৬৫, নং ৩৩৮৯। আর ইবন বায রাহিমাহুল্লাহ ‘তুহফাতুল আখইয়ার’ এর ৩৯ পৃষ্ঠায় একে হাসান বলেছেন।";
        evening_5.reward = "আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিতঃ\n" +
                "রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন যে ব্যক্তি বলে : আমি আল্লাহকে রব্ব, ইসলামকে দ্বীন এবং মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে রসূল হিসেবে সন্তুষ্টচিত্তে মেনে নিয়েছি, তার জন্য জান্নাত ওয়াজিব হয়ে গেছে।\n" +
                "\n" +
                "অন্য বর্ণনায় এসেছে, মুনাইযির (রাঃ) বলেন,\n" +
                "রসূলুল্লাহ সল্লাল্লাহু আলাইহি ওয়া সাল।লাম বলেছেন, “যে ব্যাক্তি সকালে এ বাক্যগুলো বলবে আমি দায়িত্ব গ্রহণ করছি যে, তার হাত ধরে তাকে জান্নাতে প্রবেশ করাব\u200C।\"";
        tasbihDao.insert(evening_5);

        Tasbih evening_6 = new Tasbih();
        evening_6.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_6.label = "সায়্যিদুল ইসতিগফার (ক্ষমা চাওয়ার শ্রেষ্ঠ দোআ)";
        evening_6.doa_ar = "اللّٰهُمَّ أَنْتَ رَبِّيْ لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ";
        evening_6.doa_bn = "হে আল্লাহ্\u200C! আপনি আমার রব্ব, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা। " +
                "আর আমি আমার সাধ্য মতো আপনার (তাওহীদের) অঙ্গীকার ও (জান্নাতের) প্রতিশ্রুতির উপর রয়েছি। আমি আমার কৃতকর্মের অনিষ্ট থেকে আপনার আশ্রয় চাই।" +
                "আপনি আমাকে আপনার যে নিয়ামত দিয়েছেন তা আমি স্বীকার করছি, আর আমি স্বীকার করছি আমার অপরাধ।" +
                "অতএব আপনি আমাকে মাফ করুন। নিশ্চয় আপনি ছাড়া আর কেউ গুনাহসমূহ মাফ করে না।";
        evening_6.references = "(আধুনিক প্রকাশনী- ৫৮৭৮, ইসলামিক ফাউন্ডেশন- ৫৭৭১)";
        evening_6.reward = "শাদ্দাদ ইবনু আওস (রাঃ) থেকে বর্ণিতঃ\n" +
                "নবী (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) বলেন, সাইয়্যিদুল ইস্তিগফার হলোঃ \"হে আল্লাহ! ...\" \n" +
                "যে লোক সন্ধ্যা বেলায় এ দু'আ পড়বে, আর এ রাতেই মারা যাবে, সে জান্নাতে প্রবেশ করবে। রাবী বলেন, অথবা তিনি বলেছেনঃ সে হবে জান্নাতী। আর যে লোক সকালে এ দু'আ পড়বে, আর এ দিনেই মারা যাবে সেও তেমনি জান্নাতী হবে।";
        tasbihDao.insert(evening_6);

        Tasbih evening_7 = new Tasbih();
        evening_7.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_7.label = "জাহান্নামের আগুন থেকে মুক্তি";
        evening_7.doa_ar = "اللّٰهُمَّ إِنّيْ أَصْبَحْتُ (أَمْسَيْتُ) أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيْعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللّٰهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُوْلُكَ";
        evening_7.doa_bn = "হে আল্লাহ! আমি সকালে (বিকালে) উপনীত হয়েছি। আপনাকে আমি সাক্ষী রাখছি, " +
                "আরও সাক্ষী রাখছি আপনার ‘আরশ বহনকারীদেরকে, আপনার ফেরেশতাগণকে ও আপনার সকল সৃষ্টিকে, " +
                "(এর উপর) যে— নিশ্চয় আপনিই আল্লাহ, একমাত্র আপনি ছাড়া আর কোন হক্ব ইলাহ নেই, আপনার কোনো শরীক নেই; " +
                "আর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনার বান্দা ও রাসূল।";
        evening_7.references = "(আবূ দাউদ ৪/৩১৭, নং ৫০৭১; বুখারী, আল-আদাবুল মুফরাদ, নং ১২০১; নাসাঈ, ‘আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৯; ইবনুস সুন্নী, নং ৭০। সম্মানিত শাইখ আবদুল আযীয ইবন বায রাহেমাহুল্লাহ তাঁর তুহফাতুল আখইয়ার গ্রন্থের পৃ. ২৩ এ নাসাঈ ও আবূ দাউদের সনদকে হাসান বলেছেন। [হিসনুল মুসলিম]";
        evening_7.reward = "আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ\n" +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি সকালে বা সন্ধ্যায় উপনীত হয়ে বলবেঃ  “হে আল্লাহ্\u200C! …\n" +
                "আল্লাহ তার এক-চতুর্থাংশ দেহ জাহান্নামের শাস্তি হতে মুক্তি দিবেন। আর যে ব্যক্তি তা দুইবার বলবে, আল্লাহ তার শরীরের অর্ধেক জাহান্নামের আগুন হতে মুক্তি দিবেন। আর যে ব্যক্তি তা তিনবার বলবে আল্লাহ তার শরীরের তিন-চতুর্থাংশ এবং চারবার বললে তার সমস্ত শরীর জাহান্নামের আগুন হতে মুক্তি দিবেন। ";
        tasbihDao.insert(evening_7);

        Tasbih evening_8 = new Tasbih();
        evening_8.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_8.label = "صْبَحْنَا وَأَصْبَحَ (أَمْسَيْنَا وَ أَمْسَىا) الْمُلْكُ لِلّٰهِ  (মাসনুন)";
        evening_8.doa_ar = "أَصْبَحْنَا وَأَصْبَحَ (أَمْسَيْنَا وَ أَمْسَىا) الْمُلْكُ لِلّٰهِ، وَالْحَمْدُ لِلّٰهِ، لاَ إِلَهَ إلاَّ اللّٰهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ (هَذِهِ اللَّيْلَةِ) وَخَيْرَ مَا بَعْدَهُ (بَعْدَهَا)، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هَذَا الْيَوْمِ (هَذِهِ اللَّيْلَةِ) وَشَرِّ مَا بَعْدَهُ (بَعْدَهَا)، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ";
        evening_8.doa_bn = "আমরা আল্লাহর জন্য সকালে (বিকালে) উপনীত হয়েছি, অনুরূপ যাবতীয় রাজত্বও সকালে (বিকালে) উপনীত হয়েছে, " +
                "আল্লাহ্\u200Cর জন্য। সমুদয় প্রশংসা আল্লাহ্\u200Cর জন্য। একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই। " +
                "রাজত্ব তাঁরই এবং প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান। হে রব্ব! " +
                "এই দিনের (রাতের) মাঝে এবং এর পরে যা কিছু কল্যাণ আছে আমি আপনার নিকট তা প্রার্থনা করি। " +
                "আর এই দিনের (রাতের) মাঝে এবং এর পরে যা কিছু অকল্যাণ আছে, তা থেকে আমি আপনার আশ্রয় চাই। " +
                "হে রব্ব! আমি আপনার কাছে আশ্রয় চাই অলসতা ও খারাপ বার্ধক্য থেকে। " +
                "হে রব্ব!আমি আপনার কাছে আশ্রয় চাই জাহান্নামে আযাব হওয়া থেকে এবং কবরে আযাব হওয়া থেকে।";
        evening_8.references = "মুসলিম, ৪/২০৮৮, নং ২৭২৩।";
        evening_8.reward = "রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সকাল ও সন্ধায় এ দুয়াটি বলতেন।";
        tasbihDao.insert(evening_8);

        Tasbih evening_9 = new Tasbih();
        evening_9.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_9.label = "اللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِي  (মাসনুন)";
        evening_9.doa_ar = "اللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِي، اللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِي، اللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، اللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ";
        evening_9.doa_bn = "হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার শরীরে। হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার শ্রবণশক্তিতে। " +
                "হে আল্লাহ! আমাকে নিরাপত্তা দিন আমার দৃষ্টিশক্তিতে। আপনি ছাড়া কোনো হক্ব ইলাহ নেই। " +
                "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই কুফরি ও দারিদ্র্য থেকে। আর আমি আপনার আশ্রয় চাই কবরের আযাব থেকে। " +
                "আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই।";
        evening_9.references = "আবূ দাউদ ৪/৩২৪, নং ৫০৯২; আহমাদ ৫/৪২, নং ২০৪৩০; নাসাঈ, আমালুল ইয়াওমি ওয়াল্লাইলাহ, নং ২২; ইবনুস সুন্নী, নং ৬৯; বুখারী, আল-আদাবুল মুফরাদ, নং ৭০১। আর শাইখ আল্লামা ইবন বায রাহিমাহুল্লাহ ‘তুহফাতুল আখইয়ার’ গ্রন্থের পৃ. ২৬ এ এর সনদকে হাসান বলেছেন।";
        evening_9.reward = "‘আবদুর রহমান ইবনু আবূ বাকর (রাঃ) থেকে বর্ণিতঃ\n" +
                "আমি আমার পিতাকে বললাম, হে আব্বাজান! আমি আপনাকে প্রতিদিন ভোরে ও সন্ধ্যায় তিনবার বলতে শুনি: " +
                "“হে আল্লাহ! আমার দেহ সুস্থ রাখুন। হে আল্লাহ! আমাকে সুস্থ রাখুন আমার শ্রবণ ইন্দ্রিয়ে। হে আল্লাহ! " +
                "আমাকে সুস্থ রাখুন আমার দৃষ্টিশক্তিতে। আপনি ছাড়া কোন ইলাহ নাই।” " +
                "তিনি বললেন, আমি রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে এ বাক্যগুলো দ্বারা দু‘আ করতে শুনেছি। " +
                "সেজন্য আমিও তার নিয়ম অনুসরণ করতে ভালোবাসি। ‘আব্বাস (রাঃ)-এর বর্ণনায় রয়েছে তিনি বললেনঃ " +
                "“হে আল্লাহ! আপনার নিকট কুফরী ও দরিদ্রতা হতে আশ্রয় চাইছি। হে আল্লাহ! আমি কবরের আযাব হতে আপনার নিকট আশ্রয় চাইছি, " +
                "আপনি ছাড়া অন্য কোন ইলাহ নেই।” তিনি এ দু‘আ সকালে তিনবার ও সন্ধ্যায় তিনবার করে বলতেন। " +
                "তাই আমিও তাঁর নিয়ম অনুসরণ করতে ভালোবাসি। বর্ণনাকারী বলেন, " +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: বিপদগ্রস্থ ব্যক্তির দু‘আ হলো : " +
                "“হে আল্লাহ! আমি আপনার রহমত প্রার্থী। কাজেই আমাকে এক পলকের জন্যও আমার নিজের নিকট সোপর্দ করবেন না " +
                "এবং আমার সবকিছু সুষ্ঠভাবে সম্পন্ন করে দিন। আর আপনিই একমাত্র ইলাহ।";
        tasbihDao.insert(evening_9);

        Tasbih evening_10 = new Tasbih();
        evening_10.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_10.label = "...الْعَفْوَ وَالْعَافِيَةَ...";
        evening_10.doa_ar = "اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ الدُّنْيَا وَالآخِرَةِ، اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللّٰهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَّمِيْنِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ ";
        evening_10.doa_bn = "হে আল্লাহ! আমি আপনার নিকট দুনিয়া ও আখেরাতে ক্ষমা ও নিরাপত্তা প্রার্থনা করছি। " +
                "হে আল্লাহ! আমি আপনার নিকট ক্ষমা এবং নিরাপত্তা চাচ্ছি আমার দ্বীন, দুনিয়া, পরিবার ও অর্থ-সম্পদের। " +
                "হে আল্লাহ! আপনি আমার গোপন ত্রুটিসমূহ ঢেকে রাখুন, আমার উদ্বিগ্নতাকে রূপান্তরিত করুন নিরাপত্তায়। " +
                "হে আল্লাহ! আপনি আমাকে হেফাযত করুন আমার সামনের দিক থেকে, আমার পিছনের দিক থেকে, আমার ডান দিক থেকে, আমার বাম দিক থেকে " +
                "এবং আমার উপরের দিক থেকে। আর আপনার মহত্ত্বের অসিলায় আশ্রয় চাই আমার নীচ থেকে হঠাৎ আক্রান্ত হওয়া থেকে।";
        evening_10.references = "আবূ দাউদ, নং ৫০৭৪; ইবন মাজাহ্\u200C, নং ৩৮৭১। আরও দেখুন, সহীহ ইবন মাজাহ্\u200C ২/৩৩২।";
        evening_10.reward = "জুবাইর ইবনু আবূ সুলাইমান, ইবনু জুবাইর ইবনু মুত্ব’ইম (রাঃ) সূত্র থেকে বর্ণিতঃ\n" +
                "তিনি বলেন, আমি ইবনু ‘উমার (রাঃ)-কে বলতে শুনেছি, রাসূলুল্লাহ্\u200Cর (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সকাল ও সন্ধ্যায় উপনীত হয়ে এ দু’আগুলো পড়া ছেড়ে দিতেন নাঃ “হে আল্লাহ্\u200C! ...";
        tasbihDao.insert(evening_10);

        Tasbih evening_11 = new Tasbih();
        evening_11.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_11.label = "اللّٰهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ";
        evening_11.doa_ar = "اللّٰهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَّمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَ شِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ";
        evening_11.doa_bn = "হে আল্লাহ! হে গায়েব ও উপস্থিতের জ্ঞানী, হে আসমানসমূহ ও যমীনের স্রষ্টা, হে সব কিছুর রব্ব ও মালিক! " +
                "আমি সাক্ষ্য দিচ্ছি যে, আপনি ছাড়া আর কোনো হক্ব ইলাহ নেই। আমি আপনার কাছে আশ্রয় চাই আমার আত্মার অনিষ্ট থেকে, " +
                "শয়তানের অনিষ্টতা থেকে ও তার শির্ক বা তার ফাঁদ থেকে, আমার নিজের উপর কোনো অনিষ্ট করা, " +
                "অথবা কোনো মুসলিমের দিকে তা টেনে নেওয়া থেকে।";
        evening_11.references = "তিরমিযী, নং ৩৩৯২; আবূ দাউদ, নং ৫০৬৭। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৪২।";
        evening_11.reward = "আবূ হুরাইরাহ্\u200C (রাঃ) থেকে বর্ণিতঃ\n" +
                "তিনি বলেন, আবূ বকর (রাঃ) বললেন, হে আল্লাহর রাসূল! আমাকে এমন কিছুর হুকুম দিন যা আমি সকালে ও বিকেলে উপনীত হয়ে বলতে পারি। তিনি বললেনঃ তুমি বল, “হে আল্লাহ্\u200C! …\n" +
                "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তুমি এই দু’আ সকালে, বিকেলে ও শয্যা গ্রহণকালে পাঠ করবে। ";
        tasbihDao.insert(evening_11);

        Tasbih evening_12 = new Tasbih();
        evening_12.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_12.label = "নফসের ক্ষতি হতে নিরাপর্তা";
        evening_12.doa_ar = "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ أَصْلِحْ لِيْ شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ";
        evening_12.doa_bn = "হে চিরঞ্জীব, হে চিরস্থায়ী! আমি আপনার রহমতের অসীলায় আপনার কাছে উদ্ধার কামনা করি, " +
                "আপনি আমার সার্বিক অবস্থা সংশোধন করে দিন, আর আমাকে আমার নিজের কাছে নিমেষের জন্যও সোপর্দ করবেন না।";
        evening_12.references = "তহাকেম ১/৫৪৫, তিনি হাদীসটিকে সহীহ বলেছেন, আর যাহাবী তা সমর্থন করেছেন। আরও দেখুন, সহীহ আত-তারগীব ওয়াত-তারহীব ১/২৭৩। মুন্তাখাব হাদীস ২য়/৪৬৫";
        evening_12.reward = "হযরত আনাস ইবনে মালেক (রাঃ) বর্ণনা করেনঃ\n" +
                "হুযুর সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম হযরত ফাতেমা (রাঃ) কে বললেন, আমার নসীহত মনোযোগ দিয়া শুন, তুমি সকাল সন্ধা এই দোয়া পড়িও- “ইয়া হাইয়্যু ইয়া কইয়্যুম…";
        tasbihDao.insert(evening_12);

        Tasbih evening_13 = new Tasbih();
        evening_13.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_13.label = "দশটি দাসমুক্তির অনুরূপ ও একশত সাওয়াব";
        evening_13.doa_ar = "لاَ إِلَهَ إِلاَّ اللّٰهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ";
        evening_13.doa_bn = "একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই, রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর, আর তিনি সকল কিছুর উপর ক্ষমতাবান।";
        evening_13.references = "[১] নাসাঈ, আমালুল ইয়াওমি ওয়াল-লাইলাহ, নং ২৪। আরও দেখুন, সহীহুত তারগীব ওয়াত তারহীব, ১/২৭২; ইবন বায, তুহফাতুল আখইয়ার পৃ.৪৪। এর ফযীলতের ব্যাপারে আরও দেখন, পৃ.হাদীস নং ২৫৫। \n" +
                "[২] আবূ দাউদ, নং ৫০৭৭; ইবন মাজাহ, নং ৩৭৯৮; আহমাদ নং ৮৭১৯। আরও দেখুন, সহীহুত তারগীব ওয়াত তারহীব, ১/২৭০; সহীহ আবি দাউদ ৩/৯৫৭; সহীহ ইবন মাজাহ ২/৩৩১ ও যাদুল মা‘আদ ২/৩৭৭। \n" +
                "[৩] বুখারী, ৪/৯৫, নং ৩২৯৩; মুসলিম, ৪/২০৭১, নং ২৬৯১।";
        evening_13.reward = "১০ বার [১] অথবা (অলসতা লাগলে) ১ বার [২] বলবে অথবা একশত বার বলবে";
        tasbihDao.insert(evening_13);

        Tasbih evening_14 = new Tasbih();
        evening_14.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_14.label = "উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমলের দো'আ";
        evening_14.doa_ar = "اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًاٌ";
        evening_14.doa_bn = "হে আল্লাহ! আমি আপনার নিকট উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করি।";
        evening_14.references = "হাদীসটি সংকলন করেছেন, ইবনুস সুন্নী, নং ৫৪; ইবন মাজাহ, নং ৯২৫।" +
                " আর আব্দুল কাদের ও শু‘আইব আল-আরনাঊত যাদুল মা‘আদের সম্পাদনায় ২/৩৭৫; এর সনদকে হাসান বলেছেন। " +
                "আর পূর্ব ৭৩ নং এ ও তা গত হয়েছে।";
        evening_14.reward = "উম্মু সালামাহ (রাঃ) থেকে বর্ণিতঃ\n" +
                "হুযুর সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ফজরের সালাতের পর সালাম ফিরিয়ে বলতেন, “হে আল্লাহ! …" +
                "তিন বার সকালবেলা বলবে,";
        tasbihDao.insert(evening_14);

        Tasbih evening_15 = new Tasbih();
        evening_15.tasbihType = Tasbih.TasbihType.EVENING_TASBIH;
        evening_15.label = "হে আল্লাহ! তুমি আমাকে জাহান্নাম থেকে রক্ষা করো";
        evening_15.doa_ar = "اَللّٰهُمَّ أَجِرْنِىْ مِنَ النَّارٌِ";
        evening_15.doa_bn = "হে আল্লাহ! তুমি আমাকে জাহান্নাম থেকে রক্ষা করো";
        evening_15.references = "(আবূ দাঊদ ৫০৭৯, রাহে বেলায়াত ৭ম/৪৫৩)";
        evening_15.reward = "হারিস ইবনু মুসলিম আত্ তামীমী (রহঃ) থেকে বর্ণিতঃ:\n" +
                "তাঁর পিতা হতে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। " +
                "একদিন তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মৃদুস্বরে বললেন, তুমি মাগরিবের সলাত আদায় শেষে কারো সাথে কথা বলার আগে সাতবার পড়বে," +
                " ‘‘আল্ল-হুম্মা আজিরনী মিনান্\u200Cনা-র’’ (অর্থাৎ- হে আল্লাহ! তুমি আমাকে জাহান্নাম থেকে রক্ষা করো)। " +
                "তুমি এ দু‘আ পড়ার পর ঐ রাতে মারা গেলে, তোমার জন্য জাহান্নাম হতে ছাড়পত্র লেখা হবে। " +
                "একইভাবে তুমি ফজরের সলাত আদায়ের পর এ দু‘আ পড়বে, তারপর তুমি ঐ দিন মারা গেলে, তোমাকে জাহান্নাম হতে ছাড়পত্র লেখা হবে। ";
        tasbihDao.insert(evening_15);

        Tasbih sleep_1 = new Tasbih();
        sleep_1.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_1.label = "আয়াতুল কুরসি";
        sleep_1.doa_ar = "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ ۚ اَلۡحَیُّ الۡقَیُّوۡمُ ۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ ؕ لَهٗ مَا فِی السَّمٰوٰتِ وَمَا فِی الۡاَرۡضِ ؕ مَنۡ ذَا الَّذِیۡ یَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ ؕ یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡهِمۡ وَمَا خَلۡفَهُمۡ ۚ وَلَا یُحِیۡطُوۡنَ بِشَیۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِیُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ ۚ وَلَا یَـُٔوۡدُهٗ حِفۡظُهُمَا ۚ وَهُوَ الۡعَلِیُّ الۡعَظِیۡمُ";
        sleep_1.doa_bn = "আল্লাহ ছাড়া অন্য কোন উপাস্য নেই, তিনি জীবিত, সবকিছুর ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না এবং নিদ্রাও নয়। আসমান ও যমীনে যা কিছু রয়েছে, সবই তাঁর। কে আছ এমন, যে সুপারিশ করবে তাঁর কাছে তাঁর অনুমতি ছাড়া? দৃষ্টির সামনে কিংবা পিছনে যা কিছু রয়েছে সে সবই তিনি জানেন। তাঁর জ্ঞানসীমা থেকে তারা কোন কিছুকেই পরিবেষ্টিত করতে পারে না, কিন্তু যতটুকু তিনি ইচ্ছা করেন। তাঁর সিংহাসন সমস্ত আসমান ও যমীনকে পরিবেষ্টিত করে আছে। আর সেগুলোকে ধারণ করা তাঁর পক্ষে কঠিন নয়। তিনিই সর্বোচ্চ এবং সর্বাপেক্ষা মহান।";
        sleep_1.references = "সহীহ বোখারী, (ফাতহুল বারীসহ), ৪/৪৮৭, ২৩১[১]";
        sleep_1.reward = "রসূলুল্লাহ সাঃ বলেন, 'যে কেউ যখন আপন বিছানায় যাবে এবং আয়াতুল কুরসী পড়বে, তখন সে রাতের পুরো সময় " +
                "আল্লাহর পক্ষ থেকে তার জন্য হেফাজতকারী থাকবে; আর সকাল হওয়া পর্যন্ত শয়তান তার নিকটও আসতে পারবে না।";
        tasbihDao.insert(sleep_1);

        Tasbih sleep_2 = new Tasbih();
        sleep_2.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_2.label = "بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ،...";
        sleep_2.doa_ar = "بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ.َ";
        sleep_2.doa_bn = "তোমার নামে হে মালিক! আমি আমার পার্শ্ব এলিয়ে দিলাম, তোমার নামেই তা ওঠাবো। যদি আমার রূহ তুমি আটকে দাও তবে রহম করো। আর যদি ছেড়ে দাও তবে হেফাজত করো, যেভাবে তুমি তোমার নেক্কার বান্দাদের হেফাজত করে থাকো।";
        sleep_2.references = "সহীহ বোখারী, ৬৩২০";
        sleep_2.reward = "";
        tasbihDao.insert(sleep_2);

        Tasbih sleep_3 = new Tasbih();
        sleep_3.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_3.label = "ঘুমের দু‘আ ও যিকির-৩";
        sleep_3.doa_ar = "اللَّهُمَّ رَبَّ السَّمَوَاتِ، وَرَبَّ الأَرْضِ، وَرَبَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرِاةِ وَالإِنْجِيلِ وَالفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ البَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ.َ";
        sleep_3.doa_bn = "হে আল্লাহ! নভোমন্ডলের মালিক, ভূমন্ডলের প্রতিপালক, মহান আরশের অধিপতি, হে আমাদের এবং সর্বসৃষ্টির পালনকর্তা, বীজ-দানা বিদীর্ণকারী, তাওরাত-ইঞ্জিল ও কোরআনের অবতারক, তোমার করতলগত সকল প্রাণীর অনিষ্ট থেকে আমি তোমার কাছে আশ্রয় নিলাম। হে আল্লাহ! তুমিই প্রথম, তোমার আগে কিছু নেই। তুমিই শেষ, তোমার পরে কিছু নেই। সবার উপর তুমিই প্রকাশমান, তোমার উপর কেউ নেই। সবার নিকট তুমি গুপ্ত, তোমার থেকে গুপ্ত কেউ নেই। তুমি আমাদেরকে ঋণ শোধের ব্যবস্থা করে দাও। দারিদ্র্যের মুখাপেক্ষিতা থেকে বাঁচিয়ে দাও।";
        sleep_3.references = "সহীহ মুসলিম, ২৭১৩";
        sleep_3.reward = "";
        tasbihDao.insert(sleep_3);

        Tasbih sleep_4 = new Tasbih();
        sleep_4.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_4.label = "সুরা মুলক তেলাওয়াত";
        sleep_4.doa_ar = "َ";
        sleep_4.doa_bn = "";
        sleep_4.references = "তিরমিযী, নং ৩৪০৪; নাসায়ী, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৭০৭";
        sleep_4.reward = "রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সূরা সাজদা (সূরা ৩২) এবং সূরা মুলক (সূরা ৬৭) না পড়ে ঘুমাতেন না।";
        tasbihDao.insert(sleep_4);

        Tasbih sleep_5 = new Tasbih();
        sleep_5.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_5.label = "সুরা আস-সাজদাহ্ তেলাওয়াত";
        sleep_5.doa_ar = "َ";
        sleep_5.doa_bn = "";
        sleep_5.references = "তিরমিযী, নং ৩৪০৪; নাসায়ী, আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৭০৭";
        sleep_5.reward = "রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সূরা সাজদা (সূরা ৩২) এবং সূরা মুলক (সূরা ৬৭) না পড়ে ঘুমাতেন না।";
        tasbihDao.insert(sleep_5);

        Tasbih sleep_6 = new Tasbih();
        sleep_6.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_6.label = "সুরা বাকারার শেষ ২ আয়াত তেলাওয়াত";
        sleep_6.doa_ar = "َ";
        sleep_6.doa_bn = "";
        sleep_6.references = "বুখারী, ফাতহুল বারীসহ, ৯/৯৪, ৪০০৮; মুসলিম ১/৫৫৪, নং ৮০৭";
        sleep_6.reward = "রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেনঃ যে ব্যক্তি রাতের বেলা সূরা বাকারার শেষ দুটি আয়াত পড়বে, তা তার জন্য যথেষ্ট হবে।";
        tasbihDao.insert(sleep_6);

        Tasbih sleep_7 = new Tasbih();
        sleep_7.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_7.label = "সুরা ফালাক ও নাস তেলাওয়াত";
        sleep_7.doa_ar = "َ";
        sleep_7.doa_bn = "";
        sleep_7.references = "";
        sleep_7.reward = "";
        tasbihDao.insert(sleep_7);

        Tasbih sleep_8 = new Tasbih();
        sleep_8.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_8.label = "তাসবিহে ফাতেমি পাঠ";
        sleep_8.doa_ar = "َ";
        sleep_8.doa_bn = "";
        sleep_8.references = "হিসনুল মুসলিম ২৮.৮";
        sleep_8.reward = "খাদেম অপেক্ষাও উত্তম হবে";
        tasbihDao.insert(sleep_8);

        Tasbih sleep_9 = new Tasbih();
        sleep_9.tasbihType = Tasbih.TasbihType.BEFORE_SLEEP;
        sleep_9.label = "ফিতরাতের উপর মৃত্যুবরণ করা";
        sleep_9.doa_ar = "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَا وَلاَ مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ";
        sleep_9.doa_bn = "ইয়া আল্লাহ! আমি আমার সত্ত্বা তোমার নিকট সঁপে দিলাম। আমার চেহারা তোমার অভিমুখী করে নিলাম। " +
                "আমার যাবতীয় বিষয় তোমার যিম্মায় সোপর্দ করলাম। আমার দেহ-পিঠ তোমার আশ্রয়ে রেখেদিলাম। তোমার কাছে এই সমর্পণ " +
                "তোমার সন্তুষ্টির আশায় এবং কোনো বিচ্যুতি ঘটে যাবার আশংকায়। তোমার পাকড়াও থেকে বাঁচার জন্য তোমার কাছে ফিরে " +
                "আসা ছাড়া অন্য কোনো আশ্রয় কিংবা গত্যন্তর নেই। ঈমান আনলাম তোমার নাযিল করা কিতাব এবং তোমার প্রেরিত নবীর প্রতি।";
        sleep_9.references = "সহীহ বোখারী, ৬৩১৫";
        sleep_9.reward = "যে ব্যক্তি অযুর সাথে এ দু‘আ পড়ে ঘুমাবে, ঐ রাতে যদি তার মৃত্যু হয় তবে ঈমানের সাথে মৃত্যু হয়েছে বলে গণ্য হবে।";
        tasbihDao.insert(sleep_9);

    }
}
